app/controllers/account_controller.rb

	def create
		@account=Account.create(params.require(:account).permit(:code, :total))
		@account.user=current_user
    	respond_to do |format|
			if (@account.save)
---
INSERT INTO "accounts" ("code", "created_at", "total", "updated_at") VALUES (?, ?, ?, ?)  [["code", "12334-4"], ["created_at", Mon, 09 Sep 2013 19:10:55 UTC +00:00], ["total", 100.0], ["updated_at", Mon, 09 Sep 2013 19:10:55 UTC +00:00]]
UPDATE "accounts" SET "user_id" = ?, "updated_at" = ? WHERE "accounts"."id" = 3  [["user_id", 1], ["updated_at", Mon, 09 Sep 2013 19:10:56 UTC +00:00]]