app/controllers/transfer_controller.rb

INSERT INTO "transfers" ("amount", "created_at", "dst_account_id", "scheduled_date", "src_account_id", "type", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "transfers" SET "type" = ?, "src_account_id" = ?, "dst_account_id" = ?, "amount" = ?, "scheduled_date" = ?, "user_id" = ?, "created_at" = ?, "updated_at" = ?, "id" = ?, "tax" = ? WHERE "transfers"."type" IN ('AbacaxiTransfer') AND "transfers"."id" = 2
---
  def create

    if (params[:transfer])
      transfer_params(params)
    elsif (params[:abacaxi_transfer])
      abacaxi_transfer_params(params)
    elsif (params[:bessouro_transfer])
      bessouro_transfer_params(params)
    elsif (params[:capibara_transfer])
      capibara_transfer_params(params)
    elsif (params[:damasco_transfer])
      damasco_transfer_params(params)
    end

    @transfer.user=current_user

    respond_to do |format|
      if (@transfer.save)